print("Hello Python")

### 주석 ###
# 정의 : 사용자의 메모를 뜻함

# 주성의 종류 #
# 1. #( 샵 기호 )                  : 단일 주석 ( 한줄 주석 )
# 2. ''' 이 사이것들을 주석처리 ''' : 다중 주석 ( 여러줄 주석 )
# ==> 실행결과 영향 X

# 단축기 : Ctrl + /

# 사용 이유 : 1. 내가 만든 코드 섹션( 영역 )에 대한 설명
#            2. 협업을 할때, 다른 개발자 소통하기 위해서

# 다중 주석 처리 예시
'''
작성자 : MC몽
이름 : 신동현
'''




# 출력해주는 함수 예제
print("Hello World") # 메모 ( 주석 )

### print 함수 ( 표준 출력 ) ###
# print 명령어 : 모니터 출력을 하라는 명령
# ()목적 : 함수가 처리해줄 값을 받아주는 역할
# '', "" => 문자열 파이썬은 '',"" 구분 X

print('Hello Python')
print("MCMONG")

# F5 : 파일 실행
# pycharm에서
# ctrl + shift + F10
# shift + F10

# 하나만 출력
print('# 하나만 출력합니다')
print("Hello Python Programming...!!!")
            # 여기 빈줄을 삽입한다고 해서 ( 실행창에서 == 터미널에 ) 빈 줄 삽입이 되는게 아님.
print()     # 빈줄 삽입


# 여러개 출력
print("# 여러개를 출력합니다.")
print(10, 20, 30, 40, 50) # '' 적게되면 안의 내뇽은 문자로 입력이 됨 ( == 문자처리 )
print('안녕', '저의', '이름은', '홍길동입니다.')

# 아무것도 입력하지 안ㄹ으면 단순하게 줄바꿈
print('# 아무것도 입력하지 않으면 단순하게 줄바꿈한다.')
print('---------------- 확인 전용선 ----------------')
print()
print()
print('---------------- 확인 전용선 ----------------')

