### 변수 ( Variable ) ###
# 어떤 데이터를 저장하고자 할 때 사용하는 메모리 저장소

## 변수명 생성 규칙 ##
# 1. 영문, 한글, 숫자, 언더바(_)로 구성
# 2. 특수문자는 사용 X
# 3. 대소문자는 구분이 된다.        예 ) number와 Number는 서로 다른 변수로 취급
# 4. 변수명의 첫 글자는 숫자를 사용 X   예 ) my2024 (O) / 2024my (X)
# 5. 예약어 == 키워드 ( list, dict, if, for, and ) 등은 상용 X


## 권장하는 변수명 ##
# 1. 가급적 영문 소문자로 작성
# 2. 한글은 사용하지 않고 영어 변수명 사용
# 3. 변수명을 저장된 데이터 유추가 가능하도록 사용

name = 'Alice'      # Single line 문자열 저장
age = 25            # 정수
address = '''우변번호 12345
대구시 중구 중앙대로
366 9층, 10층'''    # Multiple line 문자열 저장
boyfriend = None    # 아무 값도 저장하지 않겠다. 다른 언어 : null ( Python : None으로 표시 )
height = 168.5      # 실수를 저장

